#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.password: Refreshing state... [id=none]
heroku_app.forager: Refreshing state... [id=adtest-recipe-app-forager]
heroku_app.api: Refreshing state... [id=adtest-recipe-app-api]
heroku_addon.database: Refreshing state... [id=55f3abdf-e979-4c95-b7ec-e13b999a49ba]
heroku_build.api: Refreshing state... [id=cf06e211-4b51-4a62-b452-28563a14c6f2]
heroku_build.forager: Refreshing state... [id=e6cdc8d4-22b4-47f7-b3b6-32d67993d92c]
heroku_formation.api: Refreshing state... [id=4eed8fca-5954-455e-a770-5554e7e2664e]
heroku_formation.forager: Refreshing state... [id=f5091a03-58b4-4017-8885-a876eb934b0f]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # heroku_build.api has been changed
  ~ resource "heroku_build" "api" {
        id                = "cf06e211-4b51-4a62-b452-28563a14c6f2"
      ~ output_stream_url = "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/cf/cf06e211-4b51-4a62-b452-28563a14c6f2.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210816%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210816T151416Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=24e548ca600a2c25424544ee0f63485970e9177cdd48c3128ce42aa773e32d73" -> "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/cf/cf06e211-4b51-4a62-b452-28563a14c6f2.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210818%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210818T075311Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=9e53983693456d1aaa3494ca13d64f9a0280c560052e17b20ccedea5ff72fc23"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # heroku_build.forager has been changed
  ~ resource "heroku_build" "forager" {
        id                = "e6cdc8d4-22b4-47f7-b3b6-32d67993d92c"
      ~ output_stream_url = "https://build-output.heroku.com/streams/92/9254653a-38b5-4a6e-9193-6ea0303f8fce/logs/e6/e6cdc8d4-22b4-47f7-b3b6-32d67993d92c.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210816%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210816T151505Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=6950ee1ce99917cff2bedc9e145d5b184a5de16bfc9b195a5c492b84c38079cf" -> "https://build-output.heroku.com/streams/92/9254653a-38b5-4a6e-9193-6ea0303f8fce/logs/e6/e6cdc8d4-22b4-47f7-b3b6-32d67993d92c.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210818%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210818T075312Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=269619167afce84b92dddc78afd440b6a3429b8814945bff92ccb885a1d258d8"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # heroku_addon.mq will be created
  + resource "heroku_addon" "mq" {
      + app         = "adtest-recipe-app-api"
      + config_vars = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + plan        = "cloudamqp:lemur"
      + provider_id = (known after apply)
    }

  # heroku_addon_attachment.mq will be created
  + resource "heroku_addon_attachment" "mq" {
      + addon_id  = (known after apply)
      + app_id    = "adtest-recipe-app-forager"
      + id        = (known after apply)
      + name      = (known after apply)
      + namespace = (known after apply)
    }

  # heroku_app.api will be updated in-place
  ~ resource "heroku_app" "api" {
      ~ config_vars           = {
          + "APP_IN_QUEUE"  = "ingredients_results"
          + "APP_OUT_QUEUE" = "ingredients_lookup"
            # (1 unchanged element hidden)
        }
        id                    = "adtest-recipe-app-api"
        name                  = "adtest-recipe-app-api"
        # (11 unchanged attributes hidden)
    }

  # heroku_app.forager will be updated in-place
  ~ resource "heroku_app" "forager" {
      ~ config_vars           = {
          + "APP_IN_QUEUE"           = "ingredients_lookup"
          + "APP_OUT_QUEUE"          = "ingredients_results"
            # (3 unchanged elements hidden)
        }
        id                    = "adtest-recipe-app-forager"
        name                  = "adtest-recipe-app-forager"
      ~ sensitive_config_vars = (sensitive value)
        # (10 unchanged attributes hidden)
    }

  # heroku_build.api must be replaced
-/+ resource "heroku_build" "api" {
      ~ id                = "cf06e211-4b51-4a62-b452-28563a14c6f2" -> (known after apply)
      ~ local_checksum    = "SHA256:8745cdaf7381fd7871a89a843a5a8b76b0943a07c6e3618e6ba673cef5680f4c" -> "SHA256:3344f7346bfd77fd47b2a8eb7a7faff81b014a864f5007f01d898a2180097272" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/f4/f4355849-909b-42b9-833f-ef8260379e4f/logs/cf/cf06e211-4b51-4a62-b452-28563a14c6f2.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210818%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210818T075311Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=9e53983693456d1aaa3494ca13d64f9a0280c560052e17b20ccedea5ff72fc23" -> (known after apply)
      ~ release_id        = "241337c3-71c2-4a16-8f92-e8dd2223dd17" -> (known after apply)
      ~ slug_id           = "5607f9ea-da94-4c9f-89df-1274e8564d71" -> (known after apply)
      ~ stack             = "heroku-20" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "n13m4n0@gmail.com"
              - id    = "692ce5d5-b009-41f5-8e30-daa6b6ae9b7b"
            },
        ] -> (known after apply)
      ~ uuid              = "cf06e211-4b51-4a62-b452-28563a14c6f2" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          + checksum = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # heroku_build.forager must be replaced
-/+ resource "heroku_build" "forager" {
      ~ id                = "e6cdc8d4-22b4-47f7-b3b6-32d67993d92c" -> (known after apply)
      ~ local_checksum    = "SHA256:141843e6cbe91d82adfc30f8167bda5cceb5722f185c7007de574a4a6bfc31c4" -> "SHA256:55ca2561dc7964aeb1f3c9d28839248f97d75fb2d99aaa5803ee87f3b4563b9c" # forces replacement
      ~ output_stream_url = "https://build-output.heroku.com/streams/92/9254653a-38b5-4a6e-9193-6ea0303f8fce/logs/e6/e6cdc8d4-22b4-47f7-b3b6-32d67993d92c.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20210818%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20210818T075312Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=269619167afce84b92dddc78afd440b6a3429b8814945bff92ccb885a1d258d8" -> (known after apply)
      ~ release_id        = "fb13c175-1144-4646-ab35-7d5f17649c8d" -> (known after apply)
      ~ slug_id           = "e82e6366-008d-47ab-a87b-5a6224f8431e" -> (known after apply)
      ~ stack             = "heroku-20" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = [
          - {
              - email = "n13m4n0@gmail.com"
              - id    = "692ce5d5-b009-41f5-8e30-daa6b6ae9b7b"
            },
        ] -> (known after apply)
      ~ uuid              = "e6cdc8d4-22b4-47f7-b3b6-32d67993d92c" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ source {
          + checksum = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # random_password.forager_token will be created
  + resource "random_password" "forager_token" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 5 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @noVerity, Action: `pull_request`, Working Directory: ``, Workflow: `Plan Terraform`*